Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: If you want to use IPC between different workstations you should define wxUSE_DDE_FOR_IPC as 0 before including this header -- this will force using TCP/IP implementation even under Windows.
ja: もし異なるワークステーション間で IPC を使用したい場合、このヘッダファイルをインクルードする前に wxUSE_DDE_FOR_IPC を 0 に定義してください。これにより、Windows でも強制的に TCP/IP 版が使用されるようになります。

source: If you're using wxHtmlHelpController there is no problem at all.
ja: wxHtmlHelpController を使用しているのであれば何も問題ありません。

source: Implementation of GetBestSize() that can be overridden.
ja: オーバーライド可能な GetBestSize() の実装。

source: Implements the calculation of a box sizer's dimensions and then sets the size of its children (calling wxWindow::SetSize if the child is a window).
ja: ボックスサイザーの大きさを計算し、子コントロールのサイズをセットします。 (子コントロールがウィンドウの場合、wxWindow::SetSize を呼びます)

source: Implements the calculation of a box sizer's minimal.
ja: ボックスサイザーの最小サイズを計算します。

source: Implicit conversions
ja: 暗黙の変換

source: Important notes for multithreaded applications
ja: マルチスレッドアプリケーションにおける注意事項

source: In a GUI application, this function posts event to the specified dest object using wxEvtHandler::AddP...
ja: GUI アプリケーションにおいて、この関数は wxEvtHandler::AddPendingEvent() を使用して特定の送信先オブジェクトへイベントを送信します。

source: In a similar way, wxString provides access to its contents as either wchar_t or char character buffer.
ja: 同様に、wchar_t と char のどちらででも wxString の保持する文字列にアクセスできます。

source: In addition to a constructor from const char * which this class must have, it also provides a constructor taking a wide character file name.
ja: このクラスが必ず持たねばならない const char * のコンストラクタに加えて、ワイド文字列のファイル名を受け取るコンストラクタもこのクラスは提供しています。

source: In addition to switching adaptation on and off globally and per dialog, you can choose how aggressively wxWidgets will search for standard buttons by setting wxDialog::SetLayoutAdaptationLevel.
ja: グローバル、またはダイアログごとの適応の切り替えに加えて、wxDialog::SetLayoutAdaptationLevel を設定することでどれだけ積極的に標準ボタンを探しに行くかを選択することができます。

source: In addition to using a method of the object generating the event itself, you can use a method from a completely different object as an event handler:
ja: イベントを生成したオブジェクトに加えて、完全に別のオブジェクトのメンバ関数をイベントハンドラとして使用できます。

source: In addition, there will be a thin border around all controls to make the dialog look nice and - to make matter worse - the buttons shall be centred as the width of the dialog changes.
ja: 加えて、ダイアログの見た目を良くするためにすべてのコントロールの周りに薄いボーダーを設定し、さらに悪いことに、ダイアログの幅の変更にあわせてボダンを中央寄せで配置するものとします。

source: In any case, each implementation of wxConfigBase does its best to make the data look the same way everywhere.
ja: どのような場合でも、wxConfigBase の各実装はどこでも同じ方法でデータを扱えるように最善を尽くします。

source: In emergencies the wxExit function can be called to kill the application however normally the application shuts down automatically, see below.
ja: 緊急の場合は wxExit 関数を使用してアプリケーションを強制終了させることができます。しかし、通常、アプリケーションは自動的にシャットダウンされます。 以下を参照してください。

source: In emergencies the wxExit function can be called to kill the application however normally the application shuts down automatically, see Application Shutdown.
ja: 緊急の場合は wxExit 関数を使用してアプリケーションを強制終了させることができます。しかし、通常、アプリケーションは自動的にシャットダウンされます。 アプリケーションの終了 を参照してください。

source: In fact, wxDialog contains a default command event handler for the wxID_OK button.
ja: 実際のところ、wxDialog は wxID_OK ボタン用のデフォルトコマンドハンドラを持っています。

source: In fact, identifiers do not need to be unique across your entire application as long they are unique within the particular context you're interested in, such as a frame and its children.
ja: 実際には、特定のコンテキスト (フレームやその子コントロール) 内で一意であれば、アプリケーション全体で一意である必要はありません。

source: In fact, identifiers do not need to be unique across your entire application just so long as they are unique within a particular context you're interested in, such as a frame and its children.
ja: 実際には、特定のコンテキスト (フレームやその子コントロール) 内で一意であれば、アプリケーション全体で一意である必要はありません。

source: In fact, the event handler probably doesn't even exist in the base class as the default behaviour is often implemented in platform-specific code by the underlying toolkit or OS itself.
ja: 実際には、デフォルトの振る舞いは使用しているツールキットや OS によってプラットフォーム依存のコード内に実装されることが多いため、おそらく基底クラスにはイベントハンドラが存在しないでしょう。

source: In fact, you don't have to derive a new class from a window class if you don't want to.
ja: 実際のところ、ウィンドウクラスを継承して新しいクラスを作成したくない場合は、必ずしもそうする必要はありません。

source: In general, for strings containing many latin characters UTF8 provides a big advantage with regards to the memory footprint respect UTF16, but requires some more processing for common operations like e.g. length calculation.
ja: 一般に、主にラテン文字を含む文字列について、UTF8 は必要なメモリ消費量において UTF16 よりも大きな利点がありますが、文字列長の計算などの共通操作を行なうために、より多くの計算を必要とします。

source: In many cases (particularly dialogs under Unix and normal frames) the main window will be resizable by the user and this change of size will have to get propagated to its children.
ja: 多くの場合で (特に、Unix のダイアログや通常のフレームの場合)、メインウィンドウはリサイズ可能であり、サイズの変更を子コントロールへ伝播させる必要があるでしょう。

source: In many cases this works even for changing the behaviour of native controls.
ja: ネイティブコントロールの振る舞いを変更するような場合にも、これは動作します。

source: In order to define a new event type, there are principally two choices.
ja: 新しいイベント型を定義する方法として、主に 2 種類の選択肢があります。

source: In other cases you may need some information carried by the event argument, as in:
ja: 他の場合では、以下のように event 引数の持つ情報が必要になるかもしれません:

source: In other words, by default, the dialog is not destroyed (it might have been created on the stack, so the assumption of dynamic creation cannot be made).
ja: 言い換えると、デフォルトではダイアログは破棄されません。(ダイアログはスタック上に作られるかもしれないので、動的に生成されると仮定することはできません)

source: In our case, we want the text area to grow with the dialog, whereas the button shall have a fixed size.
ja: この例では、ダイアログに合わせてテキストエリアのサイズを変更する一方で、ボタンのサイズは固定にしたいものとします。

source: In our example case, the vertical sizer is supposed to propagate all its height changes to only the text area, not to the button area.
ja: 今回の例では、垂直方向のサイザーは高さに対するすべての変化をテキストエリアにのみ伝播させ、ボタンエリアには伝播させないようにします。

source: In particular they don't need
ja: 特に、これらを public に

source: In particular, both data transfer mechanisms store data in some kind of wxDataObject and identify its format(s) using the wxDataFormat class.
ja: 特に、両方のデータ転送の仕組みとも、ある種の wxDataObject にデータを格納し、wxDataFormat クラスを使用してフォーマットを識別します。

source: In particular, do not destroy them from application class' destructor!
ja: 特に、アプリケーションクラスのデストラクタで削除しては いけません。

source: In particular, please note that it is not enough to derive your class from wxThread and wxEvtHandler to send messages to it: in fact, this does not work at all.
ja: 特に、メッセージを送信するために wxThread クラスと wxEvtHandler を継承するだけでは 不十分 なことに注意してください: 実際のところ、これはまったく動作 しません。

source: In particular, the most common encoding used under modern Unix systems is UTF-8 and as the string above is not a valid UTF-8 byte sequence, nothing would be displayed at all in this case.
ja: 特に、最近の Unix システムで最もよく使われているエンコーディングは UTF-8 であり、上記の文字列は正しい UTF-8 バイト列ではないため、この場合は何も表示されないでしょう。

source: In particular, these classes were designed to be as easy to use as possible.
ja: 特に、これらのクラスはできるだけ簡単に使用できるように設計されています。

source: In particular, this means that errors logged by wxWidgets code itself (e.g. when it fails to perform some operation, for instance wxFile::Open() logs an error when it fails to open a file) will be processed and shown to the user.
ja: 特に、wxWidgets 自身の記録するエラー (何らかの処理の失敗時、例えば、wxFile::Open() はファイルのオープンに失敗した場合にエラーを記録します) がユーザに通知されることを意味します。

source: In practice, this would look like this if the derived text control only accepts 'a' to 'z' and 'A' to 'Z':
ja: 実際に、テキストコントロールで 'a' から 'z' と 'A' から 'Z' までのみを受け付ける場合、以下のようになります。

source: In short, this is a place where you can conveniently stuff all your data (numbers and strings) organizing it in a tree where you use the filesystem-like paths to specify the location of a piece of data.
ja: 要するに、ファイルシステムのようなパスを使用してデータの場所を指定する木構造にすべてのデータ (数値や文字列) を詰め込むことができるということです。

source: In some cases, it might be desired by the programmer to get a certain number of system events in a parent window, for example all key events sent to, but not used by, the native controls in a dialog.
ja: 例えばダイアログ内のネイティブコントロールへ送信される (そのコントロール自身では使用しない) キーイベントなど、特定のシステムイベントを親ウィンドウで取得したいと思うことがあるかもしれません。

source: In the following text, wherever iso8859-2 and windows-1250 are used, any encodings are meant and any encodings may be substituted there.
ja: 以降の文章で iso8859-2 や windows-1250 が使用されているところは任意のエンコーディングを意味しており、好きなエンコーディングに置き換えてください。

source: In the following, command line arguments are used to pass the host name (the name of the machine the server is running on) and the server name (identifying the server process).
ja: 以下ではコマンドライン引数を使用してホスト名 (サーバを実行しているマシン名)、(サーバプロセスを識別する) サーバ名を引き渡しています。

source: In the latter case, wxUSE_UTF8_LOCALE_ONLY can also be set to 1 to indicate that all strings are considered to be in UTF-8.
ja: UTF-8 ビルドを行う場合、すべての文字列が UTF-8 であることを表すために wxUSE_UTF8_LOCALE_ONLY も 1 に設定することができます。

source: In the next one, EVT_SIZE means that any changes in the size of the frame will result in calling OnSize() method.
ja: 次の行の EVT_SIZE はフレームのサイズを変更すると OnSize() を呼び出すことを意味しています。

source: In the next section we provide a short introduction to handling the events using the event tables.
ja: 次の章ではイベントテーブルを用いたイベント処理の導入部分を説明します。

source: In the rare cases when this may be important, you might prefer using GetChar() instead of the array subscript operator for this reasons.
ja: このことが重要になるような稀な場合では、添字演算子の代わりに GetChar() を使用した方が良いでしょう。

source: In the simplest possible case an event handler may not use the event parameter at all.
ja: ありえそうな一番単純な例では、イベントハンドラは event 引数をまったく使用しないかもしれません。

source: In the situations where there is no corresponding std::string function, please try to use the new wxString methods and not the old wxWidgets 1.xx variants which are deprecated and may disappear in future versions.
ja: std::string に対応する関数が存在しない場合は新しい wxString 関数を使用するようにし、wxWidgets 1.xx 版を使用しないようにしてください。これらの関数は非推奨であり、将来のバージョンでは削除されるかもしれません。

source: In these cases a single "character" may be mapped to more than one code point or viceversa more characters may be mapped to a single code point.
ja: これらの場合、ひとつの "文字" が複数のコードポイントにマッピングされたり、逆に複数の文字がひとつのコードポイントにマッピングされたりします。

source: In this case it can't guarantee constant-time access to N-th element of the string any longer as to find the position of this character in the string we have to examine all the preceding ones.
ja: その場合、文字列中のN 番目の要素へ定数時間でアクセスできることはもはや保証されません。なぜなら、その要素の位置を見つけるためにはその前の文字列をすべて調べる必要があるためです。

source: In this case the event handler function has to call Skip() so as to indicate that the search for the event handler should continue.
ja: この場合、イベントハンドラの検索を続行させるためにイベントハンドラ関数で Skip() を呼ぶ必要があります。

source: In this case, a special event handler will have to be written that will override ProcessEvent() in order to pass all events (or any selection of them) to the parent window.
ja: この場合、すべてのイベント (もしくはその中の特定のイベント) を親ウィンドウへ渡すようにイベントハンドラの ProcessEvent() をオーバーライドする必要があります。

source: In this case, due to C++ rules, the "read-only" operator[] (which is the same as GetChar()) cannot be chosen and the "read/write" operator[] (the same as GetWritableChar()) is used instead.
ja: この場合、C++ の規則により、"読み取り専用" の operator[] (これは GetChar() と同じです) は使用できず、代わりに "読み書き可能な" operator[] (これは GetWritableChar() と同じです) が使用されます。

source: In this case, the button's event table will be searched, then the parent panel's, then the frame's.
ja: この場合、まずボタンのイベントテーブルが検索され、続いて、その親パネル、フレームの順に検索されます。

source: In this case, you can use the converter-constructor, as follows:
ja: この場合、以下の変換コンストラクタを使用することができます:

source: In this example, the text validator object provides the following functionality:
ja: この例ではテキストバリデータは次の機能を提供しています:

source: In this particular case UTF8 requires more space than UTF16 (3 bytes instead of 2).
ja: この場合では、UTF8 は UTF16 よりも多くの領域が必要となります。 (2 バイトではなく 3 バイト)

source: In wxWidgets 1.xx, the OnClose function did not actually delete 'this', but signaled to the calling function (either Close, or the wxWidgets framework) to delete or not delete the window.
ja: wxWidgets 1.xx では OnClose 関数は実際に 'this' を削除せず、呼び出し元 (Close または wxWidgets フレームワーク) へウィンドウを削除するかどうかを通知していました。

source: In wxWidgets, the code fragment from above should be written instead:
ja: wxWidgets では、上記のコードの代わりに以下のように書きます

source: In your message catalogs, you need to provide individual translations of these modifiers from their lower case names (ctrl, alt, shift) so that the wxWidgets accelerator code can recognise them even when translated.
ja: メッセージカタログでは、修飾子の名前を小文字にしたもの (ctrl、alt、shift) とは別の名前に翻訳する必要があります。これによって、 wxWidgets がそれらの名前を翻訳されたものとして認識できるようになります。

source: Include files
ja: インクルードファイル

source: Indeed, the member functions should not be virtual as the event handler ignores that the functions are virtual, i.e. overriding a virtual member function in a derived class will not have any effect.
ja: 実際に、イベントテーブルはメンバ関数が仮想関数であることを無視する、つまり、仮想メンバ関数を継承クラスでオーバーライドしてもなにも影響を及ぼしません。そのため、メンバ関数を仮想関数にするべきではありません。

source: Independent of how the individual sizers lay out their children, all children have certain features in common:
ja: 個々のサイザーがどのように子コントロールを配置するかによらず、子コントロールはすべていくつかの共通機能を持ちます:

source: Installing the .mo files with your application in the appropriate location for the target system which is the one returned by wxStandardPaths::GetLocalizedResourcesDir(wxStandardPaths::ResourceCat_Messages).
ja: あなたのプログラムと一緒に .mo ファイルを対象システム内の適切な場所 (wxStandardPaths::GetLocalizedResourcesDir(wxStandardPaths::ResourceCat_Messages) の返却する場所) にインストールする。

source: Installing the .mo files with your application in the appropriate location for the target system which is the one returned by wxStandardPaths::GetLocalizedResourcesDir( wxStandardPaths::ResourceCat_Messages ).
ja: あなたのプログラムと一緒に .mo ファイルを対象システム内の適切な場所 (wxStandardPaths::GetLocalizedResourcesDir( wxStandardPaths::ResourceCat_Messages ) の返却する場所) にインストールする。

source: Instead it returns a boolean value which indicates whether processing should continue (true) or not (false).
ja: 代わりに処理を継続する (true) かしない (false) かを表す真偽値を返却します。

source: Instead of run-time crashes you will get compilation errors in this case when using Bind().
ja: Bind() を使用すると、実行時にクラッシュするかわりにコンパイルエラーが発生するようになります。

source: Instead of translating the strings in the source code to English and putting the original strings into message catalog, you may configure wxWidgets to use non-English msgids and translate to English using message catalogs:
ja: それらの文字列を英語に翻訳し、元の文字列をメッセージカタログに記載する代わりに、非英語の msgid を使用するように wxWidgets を設定し、メッセージカタログを用いて英語へ翻訳しても構いません。

source: Instead, in any place in your code, but usually in the code of the class defining the handler itself (and definitely not in the global scope as with the event tables), call its Bind<>() method like this:
ja: 代わりに、コードの任意の場所で以下のように Bind<>() を呼び出します。 (通常はイベントを処理するクラスの定義内に配置し、イベントテーブルの場合のようにグローバルスコープ内には配置しません)

source: Instead, it adds a small amount of space to each allocated block which allows it to not reallocate memory (a relatively expensive operation) too often as when, for example, a string is constructed by subsequently adding one character at a time to it, as for example in:
ja: 代わりに、各割り当て済みブロックに少しだけメモリを追加します。割り当て済みブロックを用いることで、例えば以下のように一度に一文字ずつ連結して文字列を構築する場合などに、頻繁にメモリの再割り当てを行わなくても良くなります:

source: Instead, we define some types and macros which behave differently in the Unicode and ANSI builds and allow us to avoid using conditional compilation in the program itself.
ja: その代わり、Unicode ビルドと ANSI ビルドで異なる振る舞いをする型とマクロが定義されており、これによってプログラム内で条件付きコンパイルを使用しなくても済みます。

source: Internal wxString encoding
ja: wxString の内部エンコーディング

source: Interprocess Communication
ja: プロセス間通信

source: Introduction to Events
ja: イントロダクション

source: Invokes the constraint-based layout algorithm or the sizer-based algorithm for this window...
ja: このウィンドウに対して、制約に基づく配置アルゴリズムか、サイザーに基づくアルゴリズムを実行します。

source: It also allows the direct binding of events to:
ja: また、以下のものをイベントへ直接バインドすることができます:

source: It also is able to intercept events generated by the control, providing filtering behaviour without the need to derive a new control class.
ja: また、コントロールの生成したイベントを捕まえることも可能なため、新しいコントロールクラスを継承することなく、コントロールの振る舞いをフィルタリングすることができます。

source: It also provides performance statistics gathering code which may be enabled to fine tune the memory allocation strategy for your particular application - and the gain might be quite big.
ja: また、性能の 統計収集コード も提供しており、特定のアプリケーションにあわせてメモリ割り当て戦略をチューニングすることができます。これによる性能向上効果は極めて大きいと思われます。

source: It assumes that bitmaps live in resources under Windows or OS2 and XPM files under all other platforms (for XPMs, the corresponding file must be included before this macro is used, of course, and the name of the bitmap should be the same as the resource name under Windows with _xpm suffix).
ja: このマクロは Windows と OS2 ではリソース内に、それ以外のプラットフォームでは XPM ファイルとしてビットマップが存在するものとして処理を行います。(もちろん、XPM を使用するときはこのマクロを使用する前に対応するファイルをインクルードしておく必要があり、ビットマップの名前は Windows のリソース名の末尾に _xpm を付けたものにしてください)

source: It can be also used to work with files with "non native" line termination characters and write them as "native" files if needed (in fact, the files may be written in any format).
ja: プラットフォームと異なる行端文字を扱うこともできますし、必要であればプラットフォームの行端文字に変換して書き込むことも可能です。 (実際のところ、任意の形式でファイルを書き込むことが可能です)

source: It can be corrected in one of the following ways:
ja: 下記のいずれかの方法でこれを修正することができます:

source: It can be explicitly set to 0 in setup.h under MSW or you can use --disable-unicode under Unix but doing this is strongly discouraged.
ja: MSW では setup.h 内で明示的に 0 にセットするか、Unix では --disable-unicode を使用することができますが、これは推奨しません。

source: It can sometimes be confusing to keep track of the various size-related attributes of a wxWindow, how they relate to each other, and how they interact with sizers.
ja: wxWindow のサイズに関連する属性について、お互いの関係やサイザーとの関わりについて時どき混乱することがあるかと思います。

source: It contains all the usual functions to work with files (opening/closing, reading/writing, seeking, and so on) but compared with using standard C functions, has error checking (in case of an error a message is logged using wxLog facilities) and closes the file automatically in the destructor which may be quite convenient.
ja: このクラスは (オープン/クローズ、読み書き、ファイルシークといった) 通常のファイル操作で使われる関数が含まれますが、標準 C 関数と違い、エラーチェック機能がある (エラーが発生した場合、 wxLog 機能を使ってメッセージがログ出力されます) ほか、デストラクタで自動的にファイルがクローズされます。

source: It could be a useful technique for on-line tutorials, too, where you take a user through a serious of steps and don't want them to diverge from the lesson.
ja: これはオンラインチュートリアルでも有用なテクニックです。レッスンから外れることなく、ユーザに一連のステップを実行させることができます。

source: It defines, for example, the API of OnSysRead(), OnSysWrite(), OnSysSeek() and OnSysTell().
ja: このクラスは例えば OnSysRead()、OnSysWrite()、OnSysSeek()、OnSysTell() などの API を定義しています。

source: It defines, for example, the API of OnSysRead, OnSysWrite, OnSysSeek and OnSysTell.
ja: このクラスは例えば OnSysRead、OnSysWrite、OnSysSeek、OnSysTell などの API を定義しています。

source: It doesn't matter where it appears but it's customary to put it at the end because the macro changes the access type internally so it's safest if nothing follows it.
ja: どこに挿入しても構いませんが、慣習的にクラス宣言の最後に配置します。これはこのマクロがアクセス制御を内部的に変更してしまうからで、宣言の後ろに何もなければ一番安全だからです。

source: It filters input characters so that only alphabetic characters are allowed.
ja: 入力文字をフィルタリングし、アルファベットしか入力できないようにします。

source: It focuses on handling charsets related problems.
ja: 文字コードに関連した問題について取り組む場合には。

source: It goes like this:
ja: これは次のようになります:

source: It goes without saying that a profiler should be used to measure the precise difference the change to EXTRA_ALLOC makes to your program.
ja: 言うまでもないことですが、EXTRA_ALLOC を変更したときの正確な違いを計測するためにプロファイラを使用するべきです。

source: It implements Read(), SeekI() (I for Input), and all read or IO generic related functions.
ja: このクラスでは Read()、SeekI() (I は Input を表します) と、読み取りや入出力に関するすべての関数を実装しています。

source: It implements Read, SeekI (I for Input), and all read or IO generic related functions.
ja: このクラスでは Read、SeekI (I は Input を表します) と、読み取りや入出力に関するすべての関数を実装しています。

source: It involves editing the .po file.
ja: これは .po ファイルを編集することで行います。

source: It is 4 bytes under Unix systems, corresponding to the tradition of using UTF-32, but only 2 bytes under Windows which is required by compatibility with the OS which uses UTF-16.
ja: Unix システムでは UTF-32 を使用してきた慣習にあわせて 4 バイトですが、Windows では UTF-16 を使用する OS との互換性のため、2 バイトとなっています。

source: It is advised that you use c_str() instead to clearly indicate when the conversion is done.
ja: 変換を行なうタイミングを明確にするために、代わりに c_str() を使用するようにしてください。

source: It is advised that you use wxString::c_str() instead to clearly indicate when the conversion is done.
ja: 変換を行なうタイミングを明確にするために、代わりに wxString::c_str() を使用するようにしてください。

source: It is also possible to propagate the event only a limited number of times and not until it is processed (or a top level parent window is reached).
ja: イベントの伝播回数を制限することも可能ですし、処理されるまで (もしくはトップレベルの親ウィンドウに到達するまで) 伝播させることも可能です。

source: It is based upon the idea of individual subwindows reporting their minimal required size and their ability to get stretched if the size of the parent window has changed.
ja: このアルゴリズムは、必要最小限のサイズを通知し、親ウィンドウのサイズが変化した場合にそれにあわせてサイズを変更することのできる、個別のサブウィンドウという考えに基づいています。

source: It is especially well suited for working with configuration files and program source files.
ja: このクラスは設定ファイルやソースファイルを扱う場合に特に適しています。

source: It is helpful when a string must be broken into tokens and replaces the standard C library strtok() function.
ja: このクラスは文字列をトークンに分解する必要があるときに便利で、標準 C ライブラリの strtok() 関数の代わりになります。

source: It is interpreted as a weight factor, i.e. it can be zero, indicating that the window may not be resized at all, or above zero.
ja: これは重み係数として解釈されます。つまり、値を 0 (この場合、ウィンドウはまったくリサイズされません) か、0 より大きい値にすることができます。

source: It is no longer enough to just depend on the default byte-sized character set that computers have traditionally used.
ja: コンピュータが昔から使用しているデフォルトのバイト単位の文字コードに依存するだけではもう不十分です。

source: It is nonetheless recommended to use iterators (instead of index based access) like this:
ja: とはいえ、(インデックスによるアクセスの代わりに) このように イテレータ を使用することを推奨します:

source: It is strongly advised to recompile your code with a compiler warning about passing non-POD objects to vararg functions, such as g++.
ja: g++ など、非 POD オブジェクトを可変引数関数に渡すと警告を出すコンパイラを使用してコードをコンパイルし直すことを強く推奨します。

source: It is the duty of the application to define a suitable event handler, and decide whether or not to destroy the window.
ja: 適切なイベントハンドラを定義し、ウィンドウを破棄するか決定するのはアプリケーションの責務です。

source: It is the unique feature of a box sizer, that it can grow in both directions (height and width) but can distribute its growth in the main direction (horizontal for a row) unevenly among its children.
ja: ボックスサイザーに固有の機能として、両方 (高さと幅) の方向に伸長させることができる一方で、主となる方向 (行に対しては水平方向) のサイズ変更を子コントロールに対して 不規則に 分配できる点が挙げられます。

source: It is then safe to end the dialog by calling wxDialog::EndModal (if modal) or wxDialog::Show (if modeless).
ja: そのときは wxDialog::EndModal (モーダルの場合) や wxDialog::Show (モードレスの場合) を呼んでダイアログを終了しても安全です。

source: It is then safe to end the dialog by calling EndModal (if modal) or Show (if modeless).
ja: そのときは EndModal (モーダルの場合) や Show (モードレスの場合) を呼んでダイアログを終了しても安全です。

source: It is used internally only and must not be called by the user.
ja: この関数は内部でのみ使用されるもので、ユーザが呼んではいけません。

source: It logs the specified message text as well as the last system error code (errno or Windows' GetLastError() depending on the platform) and the corresponding error message.
ja: この関数は指定したメッセージとあわせて、最後のシステムエラーコード (プラットフォームに応じて errno または Windows の ::GetLastError() ) とそれに対応するエラーメッセージを出力します。

source: It logs the specified message text as well as the last system error code (errno or ::GetLastError() depending on the platform) and the corresponding error message.
ja: この関数は指定したメッセージとあわせて、最後のシステムエラーコード (プラットフォームに応じて errno または ::GetLastError() ) とそれに対応するエラーメッセージを出力します。
